{"pageProps":{"post":{"title":"🇨🇷 La Chumeca Poche 777 from 🇦🇹 Kaffein","slug":"poche-777-kaffein","excerpt":"Specially processed coffee which I had to transport in my cycling jersey - quite impractical since it was not packed for that.","date":"2023-06-18","text":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"In May we got a new roommate who, as it turned out, works as a content creator at ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://kaffein.at/en/"},"content":[{"nodeType":"text","value":"Kaffein","marks":[{"type":"bold"}],"data":{}}]},{"nodeType":"text","value":", beautiful roastery in Vienna, Austria at prime locations in the center. I went to one such on a bike, tasting the perfect cycle paths in the city center for the first time. With the goal to buy a new coffee, I asked for recommendations from the barista, who took me to a fancy-looking back room in the style of Apple Stores, where their iconic aluminum doses presented their current offering. After a brief discussion I opted for a special (and pricier) Costa Rica.","marks":[],"data":{}}]},{"nodeType":"embedded-asset-block","data":{"target":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"q8qwkuwzj5j8"}},"id":"jENc5rL5A9TO2vg7FOAqd","type":"Asset","createdAt":"2023-09-24T15:44:27.553Z","updatedAt":"2023-09-24T15:44:27.553Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"locale":"en-US"},"fields":{"title":"Poche 777 package","description":"","file":{"url":"//images.ctfassets.net/q8qwkuwzj5j8/jENc5rL5A9TO2vg7FOAqd/e4ad5d6e29e7ea3045c95570e492ad9c/IMG_5214.jpg","details":{"size":1117828,"image":{"width":3024,"height":4032}},"fileName":"IMG_5214.jpg","contentType":"image/jpeg"}}}},"content":[]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The name of the coffee, Poche 777, highlights the special way in which it was processed. Starting with aerobic fermentation in high-temperature tanks, it then went through anaerobic fermentation and finished the whole process drying in the sun on raised beds, spending 7 days at each part. The package points to a more fruity and light-roasted coffee, although their website presents it as dark-roasted. And at this point, I don't remember what it looked like, but I would bet on a more light roast, in hand with the cup profile.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The beans themselves were a Yellow Catuai variety, suggesting a high altitude, common to Central America, but I couldn't find more information about this particular one - the package may look fancy, but it doesn't hold much information. Taste profile definitely points to more fruity, with stewed apple, kiwi, strawberry yoghurt, and cherry passionfruit, whatever that is. When I bought it, it was already quite old - almost two months, with a roast date of 25th April, which I didn't really like. Overall, as I'm writing this quite late, I don't remember much about the coffee itself - definitely nothing bad, but probably again too difficult to master and maybe overpriced, given everything around it.","marks":[],"data":{}}]}]},"written_at":"2023-09-24T15:45:11.344Z","updated_at":"2023-09-24T15:45:11.344Z"}},"__N_SSG":true}