{"pageProps":{"post":{"title":"🇪🇹 Sasaba from 🇩🇪 Bonanza Coffee","slug":"bonanza-sasaba","excerpt":"Delicious signature coffee from a Berlin roastery which I got while visiting my friend. Still using only french press, but also upgrading my grinder to the 1Zpresso Q2.","date":"2022-05-14","text":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"In May I visited my friend in Berlin, Germany. Knowing that one of the goals of my trip was to buy myself some next coffee to try, she recommended ","nodeType":"text"},{"data":{"uri":"https://bonanzacoffee.de"},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Bonanza Coffee","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":", a chain of cafés and roasteries in Berlin, voted best Cafés and Coffee Roasteries in Germany in 2022 and also distributing to Asia with branches in South Korea.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"It didn't take long to choose - I went for ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Sasaba Ethiopia coffee","nodeType":"text"},{"data":{},"marks":[],"value":", medium (omni) roast, probably the most famous one from Bonanza and a winning coffee of several brewers' cups and barista championships. Coming from the ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Guji region in Ethiopia","nodeType":"text"},{"data":{},"marks":[],"value":", the beans are mixed local heirloom varietals, term referring to old arabica plant varietals in Ethiopia. The coffee was naturally processed in the ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Sasaba Washing Station","nodeType":"text"},{"data":{},"marks":[],"value":", founded in 2005 and owned by Tsegay Hagos Tsefaye, which collects coffee from more than 500 smallholders in the Guji region, washes or naturally processes them (depending on the coffee) and then distributes the final product. The natural coffees, as was the case with this Sasaba Ethiopia from Bonanza, usually dry for 15 to 20 days.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The story of the Sasaba Washing Station is an interesting one, and you can read more about it ","nodeType":"text"},{"data":{"uri":"https://www.trabocca.com/our-coffees/ethiopia/guji/sasaba-washing-station/"},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"here","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":". Tsegay Tsefaye, the founder and owner, focuses a lot on the smallholders growing the coffee - he trains them regularly and pays out premiums for outstanding quality. It is located near the town of ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Bule Hora in the Goji Zone in Oromia Region","nodeType":"text"},{"data":{},"marks":[],"value":". The farms are located around there as well.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Coming to the taste profile, the Sasaba Washing Station is known for several of them, with the main one being ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"peach","nodeType":"text"},{"data":{},"marks":[],"value":", which is also one of the profiles of this Sasaba Ethiopia coffee. However, the most significant is ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"milk chocolate","nodeType":"text"},{"data":{},"marks":[],"value":", which I could really taste, and the third one is ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"vanilla","nodeType":"text"},{"data":{},"marks":[],"value":". I have used only french press when preparing this coffee, but this was around the time when I upgraded my grinder - to the 1Zpresso Q2, an amazing one. With that, I have really enjoyed this coffee, it is still to this day the favorite one I've had, and it tasted great - especially the strong note of milk chocolate. Next time I'm in Berlin, I know what I'm buying again.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The terms that Bonanza Coffee likes to use - Unnecessarily Good and Not Your Typical - are true.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"},"written_at":"2023-03-17T21:59:52.834Z","updated_at":"2023-03-19T14:43:18.675Z"}},"__N_SSG":true}