{"pageProps":{"post":{"title":"🇪🇹 Agaro & Jimma from 🇨🇿 BALANCE coffee & wine","slug":"balance-agaro-jimma","excerpt":"My first espresso roast, bought on my cycling journey from Vienna to Prague. A better espresso machine would definitely make it better, but we still enjoyed it at home during the summer.","bought_at":"2022-07-01","text":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"When I cycled from Vienna to Prague at the beginning of the summer, I stayed at my friend's place one night in Znojmo, a wine town near the borders of Czechia with Austria. Her sister owns a ","nodeType":"text"},{"data":{"uri":"https://balancecoffeewine.cz"},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"very nice café","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":" (serving a delicious breakfast!) and they recently also started roasting coffee, in cooperation with the Coffeesquare roastery nearby. Knowing that I'm coming home for the summer and I could take advantage of the coffee machines we got, I opted for an espresso roast and got recommended this ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Ethiopean Agaro & Jimma","nodeType":"text"},{"data":{},"marks":[],"value":".","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"As the name suggests, it comes from the town ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Agaro in the Jimma Zone, Oromia region","nodeType":"text"},{"data":{},"marks":[],"value":". This one is from a small farmer ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Mustefa Abakeno","nodeType":"text"},{"data":{},"marks":[],"value":", who farms at 18 hectares of land between 2000 and 2100 MASL. Mustefa set up a wet mill to process his and his neighbors' coffee, where he also naturally processed the beans that I took home. He is also able to wash-process coffee, and, with the changes in Ethiopean regulations in the last years, he has also started selling coffee directly to buyers.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Regarding varietals, this coffee is a 100% arabica, combination of the classic Ethiopian heirloom and specifically their two ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"sub-varieties 74110 and 74112","nodeType":"text"},{"data":{},"marks":[],"value":", which were developed at the Jimma Agricultural Research Center for resistance to coffee berry disease. The 74 indicates their cataloging year of 1974. The trees are short with small leaves, cherries, and beans, and this makes for a delicious washed coffee.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The flavor profile is quite wide with ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"strawberry mousse, yellow apple, ripe fig, and milk chocolate.","nodeType":"text"},{"data":{},"marks":[],"value":" More importantly, however, the coffee is quite sweet and very creamy, which is something I remember very well as well. My mom found it quite sour and didn't like it, unlike me. I wasn't able to confirm any of the taste hints, but I really enjoyed this espresso. Apparently, it scored 87 cupping score points, in the \"excellent\" range.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"},"written_at":"2023-03-17T22:19:59.916Z","updated_at":"2023-03-19T14:49:51.708Z"}},"__N_SSG":true}