{"pageProps":{"post":{"title":"🇨🇴 Lord Voldemort from 🇨🇿 Beansmith.s","slug":"lord-voldemort-beansmiths","excerpt":"Washed filter coffee that we bought in the office. I didn't like that much, but it was the start of my V60 brewing and also a learning experience when I got to watch my colleague prepare it.","bought_at":"2022-09-05","text":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"I spent my summer in Prague, usually in the office. Both my colleague Petr and I recently got into specialty filter coffee, so we were discussing it often, he was teaching me how to prepare the Hario V60 and together we bought and tried some interesting roasts. One of them was this one, from a Czech roastery ","nodeType":"text"},{"data":{"uri":"https://beansmiths.com"},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Beansmith.s","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":", called ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Lord Voldemort","nodeType":"text"},{"data":{},"marks":[],"value":" (apparently the farmer, Deiro Garcia, is very much a Potterhead), bought at ","nodeType":"text"},{"data":{"uri":"https://www.kofio.cz"},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Kofio","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":".","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This coffee comes from the ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Huila","nodeType":"text"},{"data":{},"marks":[],"value":" region of Colombia, said to be the place where this variety, ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Pink Bourbon","nodeType":"text"},{"data":{},"marks":[],"value":" - a hybrid of the Red and Yellow Bourbon, was first found. As the name suggests, the ripe cherries are pink, and the variety is quite challenging to cultivate and produce consistently. The pink genome is easily overtaken by others and the trees, therefore, have to be carefully separated from other plants.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"As if that was not enough, the beans are ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"washed","nodeType":"text"},{"data":{},"marks":[],"value":", an interesting fermentation process that is natural for this type, done in concrete tanks for 24 hours. During the washing, the fruit layers (the skin and the mucilage around the beans) have been removed before the drying, unlike in the natural process. This should give the coffee a \"cleaner\" taste, focused more on the bean itself, rather than anything else in the process.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This was really an interesting coffee. The first thing you notice is the smell - very fruity. The official taste profile says ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"white grapes, grapefruit, and nut butter","nodeType":"text"},{"data":{},"marks":[],"value":", and the smell really hints at the (grape)fruity part. For the preparation, I used both french press and Hario V60, as this was the first coffee on which I learned the latter - and I did struggle a bit with the Hoffmann method, especially with making just one cup for myself compared with making two for me and Petr in the office.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The final coffee was usually quite sweet and tasted of nuts, but usually, I found that it smelled better than it tasted to me. I would describe the taste as \"light\" rather than intensive or full, but I can't say I really liked it, I didn't manage to make it in such a way I would be satisfied with it. Interesting, but confusing.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"},"written_at":"2023-03-17T22:23:16.526Z","updated_at":"2023-03-19T14:54:03.842Z"}},"__N_SSG":true}